---
kind: property
id: P:Autodesk.Revit.DB.Visual.Gradient.GradientNoiseLevels
source: html/6607d9d6-d534-4f52-5d03-3cd9cfced73f.htm
---
# Autodesk.Revit.DB.Visual.Gradient.GradientNoiseLevels Property

The property labeled "Levels" from the "Gradient" schema.

## Syntax (C#)
```csharp
public static string GradientNoiseLevels { get; }
```

## Remarks
This property is of type "AssetPropertyDouble" within the range of "1, 10".